Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_fdcan2.h
// TOCC Configuration

#define FDCAN2_TOCC_TOP         (0xFFFFU<<16)
#define FDCAN2_TOCC_TOP_0       (0x1U<<16)
#define FDCAN2_TOCC_TOS         (0x3U<<1)
#define FDCAN2_TOCC_TOS_0       (0x1U<<1)
#define FDCAN2_TOCC_ETOC        (0x1U<<0)

// TOCV Configuration

#define FDCAN2_TOCV_TOC         (0xFFFFU<<0)
#define FDCAN2_TOCV_TOC_0       (0x1U<<0)

// ECR Configuration

#define FDCAN2_ECR_TEC          (0xFFU<<0)
#define FDCAN2_ECR_TEC_0        (0x1U<<0)
#define FDCAN2_ECR_TREC         (0x7FU<<8)
#define FDCAN2_ECR_TREC_0       (0x1U<<8)
#define FDCAN2_ECR_RP           (0x1U<<15)
#define FDCAN2_ECR_CEL          (0xFFU<<16)
#define FDCAN2_ECR_CEL_0        (0x1U<<16)

// PSR Configuration

#define FDCAN2_PSR_TDCV         (0x7FU<<16)
#define FDCAN2_PSR_TDCV_0       (0x1U<<16)
#define FDCAN2_PSR_PXE          (0x1U<<14)
#define FDCAN2_PSR_REDL         (0x1U<<13)
#define FDCAN2_PSR_RBRS         (0x1U<<12)
#define FDCAN2_PSR_RESI         (0x1U<<11)
#define FDCAN2_PSR_DLEC         (0x7U<<8)
#define FDCAN2_PSR_DLEC_0       (0x1U<<8)
#define FDCAN2_PSR_BO           (0x1U<<7)
#define FDCAN2_PSR_EW           (0x1U<<6)
#define FDCAN2_PSR_EP           (0x1U<<5)
#define FDCAN2_PSR_ACT          (0x3U<<3)
#define FDCAN2_PSR_ACT_0        (0x1U<<3)
#define FDCAN2_PSR_LEC          (0x7U<<0)
#define FDCAN2_PSR_LEC_0        (0x1U<<0)

// TDCR Configuration

#define FDCAN2_TDCR_TDCO        (0x7FU<<8)
#define FDCAN2_TDCR_TDCO_0      (0x1U<<8)
#define FDCAN2_TDCR_TDCF        (0x7FU<<0)
#define FDCAN2_TDCR_TDCF_0      (0x1U<<0)

// IR Configuration

#define FDCAN2_IR_ARA           (0x1U<<29)
#define FDCAN2_IR_PED           (0x1U<<28)
#define FDCAN2_IR_PEA           (0x1U<<27)
#define FDCAN2_IR_WDI           (0x1U<<26)
#define FDCAN2_IR_BO            (0x1U<<25)
#define FDCAN2_IR_EW            (0x1U<<24)
#define FDCAN2_IR_EP            (0x1U<<23)
#define FDCAN2_IR_ELO           (0x1U<<22)
#define FDCAN2_IR_DRX           (0x1U<<19)
#define FDCAN2_IR_TOO           (0x1U<<18)
#define FDCAN2_IR_MRAF          (0x1U<<17)
#define FDCAN2_IR_TSW           (0x1U<<16)
#define FDCAN2_IR_TEFL          (0x1U<<15)
#define FDCAN2_IR_TEFF          (0x1U<<14)
#define FDCAN2_IR_TEFW          (0x1U<<13)
#define FDCAN2_IR_TEFN          (0x1U<<12)
#define FDCAN2_IR_TEF           (0x1U<<11)
#define FDCAN2_IR_TCF           (0x1U<<10)
#define FDCAN2_IR_TC            (0x1U<<9)
#define FDCAN2_IR_HPM           (0x1U<<8)
#define FDCAN2_IR_RF1L          (0x1U<<7)
#define FDCAN2_IR_RF1F          (0x1U<<6)
#define FDCAN2_IR_RF1W          (0x1U<<5)
#define FDCAN2_IR_RF1N          (0x1U<<4)
#define FDCAN2_IR_RF0L          (0x1U<<3)
#define FDCAN2_IR_RF0F          (0x1U<<2)
#define FDCAN2_IR_RF0W          (0x1U<<1)
#define FDCAN2_IR_RF0N          (0x1U<<0)

// IE Configuration

#define FDCAN2_IE_ARAE          (0x1U<<29)
#define FDCAN2_IE_PEDE          (0x1U<<28)
#define FDCAN2_IE_PEAE          (0x1U<<27)
#define FDCAN2_IE_WDIE          (0x1U<<26)
#define FDCAN2_IE_BOE           (0x1U<<25)
#define FDCAN2_IE_EWE           (0x1U<<24)
#define FDCAN2_IE_EPE           (0x1U<<23)
#define FDCAN2_IE_ELOE          (0x1U<<22)
#define FDCAN2_IE_BEUE          (0x1U<<21)
#define FDCAN2_IE_BECE          (0x1U<<20)
#define FDCAN2_IE_DRXE          (0x1U<<19)
#define FDCAN2_IE_TOOE          (0x1U<<18)
#define FDCAN2_IE_MRAFE         (0x1U<<17)
#define FDCAN2_IE_TSWE          (0x1U<<16)
#define FDCAN2_IE_TEFLE         (0x1U<<15)
#define FDCAN2_IE_TEFFE         (0x1U<<14)
#define FDCAN2_IE_TEFWE         (0x1U<<13)
#define FDCAN2_IE_TEFNE         (0x1U<<12)
#define FDCAN2_IE_TEFE          (0x1U<<11)
#define FDCAN2_IE_TCFE          (0x1U<<10)
#define FDCAN2_IE_TCE           (0x1U<<9)
#define FDCAN2_IE_HPME          (0x1U<<8)
#define FDCAN2_IE_RF1LE         (0x1U<<7)
#define FDCAN2_IE_RF1FE         (0x1U<<6)
#define FDCAN2_IE_RF1WE         (0x1U<<5)
#define FDCAN2_IE_RF1NE         (0x1U<<4)
#define FDCAN2_IE_RF0LE         (0x1U<<3)
#define FDCAN2_IE_RF0FE         (0x1U<<2)
#define FDCAN2_IE_RF0WE         (0x1U<<1)
#define FDCAN2_IE_RF0NE         (0x1U<<0)

// ILS Configuration

#define FDCAN2_ILS_ARAL         (0x1U<<29)
#define FDCAN2_ILS_PEDL         (0x1U<<28)
#define FDCAN2_ILS_PEAL         (0x1U<<27)
#define FDCAN2_ILS_WDIL         (0x1U<<26)
#define FDCAN2_ILS_BOL          (0x1U<<25)
#define FDCAN2_ILS_EWL          (0x1U<<24)
#define FDCAN2_ILS_EPL          (0x1U<<23)
#define FDCAN2_ILS_ELOL         (0x1U<<22)
#define FDCAN2_ILS_BEUL         (0x1U<<21)
#define FDCAN2_ILS_BECL         (0x1U<<20)
#define FDCAN2_ILS_DRXL         (0x1U<<19)
#define FDCAN2_ILS_TOOL         (0x1U<<18)
#define FDCAN2_ILS_MRAFL        (0x1U<<17)
#define FDCAN2_ILS_TSWL         (0x1U<<16)
#define FDCAN2_ILS_TEFLL        (0x1U<<15)
#define FDCAN2_ILS_TEFFL        (0x1U<<14)
#define FDCAN2_ILS_TEFWL        (0x1U<<13)
#define FDCAN2_ILS_TEFNL        (0x1U<<12)
#define FDCAN2_ILS_TEFL         (0x1U<<11)
#define FDCAN2_ILS_TCFL         (0x1U<<10)
#define FDCAN2_ILS_TCL          (0x1U<<9)
#define FDCAN2_ILS_HPML         (0x1U<<8)
#define FDCAN2_ILS_RF1LL        (0x1U<<7)
#define FDCAN2_ILS_RF1FL        (0x1U<<6)
#define FDCAN2_ILS_RF1WL        (0x1U<<5)
#define FDCAN2_ILS_RF1NL        (0x1U<<4)
#define FDCAN2_ILS_RF0LL        (0x1U<<3)
#define FDCAN2_ILS_RF0FL        (0x1U<<2)
#define FDCAN2_ILS_RF0WL        (0x1U<<1)
#define FDCAN2_ILS_RF0NL        (0x1U<<0)

// ILE Configuration

#define FDCAN2_ILE_EINT1        (0x1U<<1)
#define FDCAN2_ILE_EINT0        (0x1U<<0)

// GFC Configuration

#define FDCAN2_GFC_ANFS         (0x3U<<4)
#define FDCAN2_GFC_ANFS_0       (0x1U<<4)
#define FDCAN2_GFC_ANFE         (0x3U<<2)
#define FDCAN2_GFC_ANFE_0       (0x1U<<2)
#define FDCAN2_GFC_RRFS         (0x1U<<1)
#define FDCAN2_GFC_RRFE         (0x1U<<0)

// SIDFC Configuration

#define FDCAN2_SIDFC_LSS        (0xFFU<<16)
#define FDCAN2_SIDFC_LSS_0      (0x1U<<16)
#define FDCAN2_SIDFC_FLSSA      (0x3FFFU<<2)
#define FDCAN2_SIDFC_FLSSA_0    (0x1U<<2)

// XIDFC Configuration

#define FDCAN2_XIDFC_LSE        (0xFFU<<16)
#define FDCAN2_XIDFC_LSE_0      (0x1U<<16)
#define FDCAN2_XIDFC_FLESA      (0x3FFFU<<2)
#define FDCAN2_XIDFC_FLESA_0    (0x1U<<2)

// XIDAM Configuration

