Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_fdcan2.h
#define FDCAN2_XIDAM_EIDM       (0x1FFFFFFFU<<0)
#define FDCAN2_XIDAM_EIDM_0     (0x1U<<0)

// HPMS Configuration

#define FDCAN2_HPMS_FLST        (0x1U<<15)
#define FDCAN2_HPMS_FIDX        (0x7FU<<8)
#define FDCAN2_HPMS_FIDX_0      (0x1U<<8)
#define FDCAN2_HPMS_MSI         (0x3U<<6)
#define FDCAN2_HPMS_MSI_0       (0x1U<<6)
#define FDCAN2_HPMS_BIDX        (0x3FU<<0)
#define FDCAN2_HPMS_BIDX_0      (0x1U<<0)

// NDAT1 Configuration

#define FDCAN2_NDAT1_ND31       (0x1U<<31)
#define FDCAN2_NDAT1_ND30       (0x1U<<30)
#define FDCAN2_NDAT1_ND29       (0x1U<<29)
#define FDCAN2_NDAT1_ND28       (0x1U<<28)
#define FDCAN2_NDAT1_ND27       (0x1U<<27)
#define FDCAN2_NDAT1_ND26       (0x1U<<26)
#define FDCAN2_NDAT1_ND25       (0x1U<<25)
#define FDCAN2_NDAT1_ND24       (0x1U<<24)
#define FDCAN2_NDAT1_ND23       (0x1U<<23)
#define FDCAN2_NDAT1_ND22       (0x1U<<22)
#define FDCAN2_NDAT1_ND21       (0x1U<<21)
#define FDCAN2_NDAT1_ND20       (0x1U<<20)
#define FDCAN2_NDAT1_ND19       (0x1U<<19)
#define FDCAN2_NDAT1_ND18       (0x1U<<18)
#define FDCAN2_NDAT1_ND17       (0x1U<<17)
#define FDCAN2_NDAT1_ND16       (0x1U<<16)
#define FDCAN2_NDAT1_ND15       (0x1U<<15)
#define FDCAN2_NDAT1_ND14       (0x1U<<14)
#define FDCAN2_NDAT1_ND13       (0x1U<<13)
#define FDCAN2_NDAT1_ND12       (0x1U<<12)
#define FDCAN2_NDAT1_ND11       (0x1U<<11)
#define FDCAN2_NDAT1_ND10       (0x1U<<10)
#define FDCAN2_NDAT1_ND9        (0x1U<<9)
#define FDCAN2_NDAT1_ND8        (0x1U<<8)
#define FDCAN2_NDAT1_ND7        (0x1U<<7)
#define FDCAN2_NDAT1_ND6        (0x1U<<6)
#define FDCAN2_NDAT1_ND5        (0x1U<<5)
#define FDCAN2_NDAT1_ND4        (0x1U<<4)
#define FDCAN2_NDAT1_ND3        (0x1U<<3)
#define FDCAN2_NDAT1_ND2        (0x1U<<2)
#define FDCAN2_NDAT1_ND1        (0x1U<<1)
#define FDCAN2_NDAT1_ND0        (0x1U<<0)

// NDAT2 Configuration

#define FDCAN2_NDAT2_ND63       (0x1U<<31)
#define FDCAN2_NDAT2_ND62       (0x1U<<30)
#define FDCAN2_NDAT2_ND61       (0x1U<<29)
#define FDCAN2_NDAT2_ND60       (0x1U<<28)
#define FDCAN2_NDAT2_ND59       (0x1U<<27)
#define FDCAN2_NDAT2_ND58       (0x1U<<26)
#define FDCAN2_NDAT2_ND57       (0x1U<<25)
#define FDCAN2_NDAT2_ND56       (0x1U<<24)
#define FDCAN2_NDAT2_ND55       (0x1U<<23)
#define FDCAN2_NDAT2_ND54       (0x1U<<22)
#define FDCAN2_NDAT2_ND53       (0x1U<<21)
#define FDCAN2_NDAT2_ND52       (0x1U<<20)
#define FDCAN2_NDAT2_ND51       (0x1U<<19)
#define FDCAN2_NDAT2_ND50       (0x1U<<18)
#define FDCAN2_NDAT2_ND49       (0x1U<<17)
#define FDCAN2_NDAT2_ND48       (0x1U<<16)
#define FDCAN2_NDAT2_ND47       (0x1U<<15)
#define FDCAN2_NDAT2_ND46       (0x1U<<14)
#define FDCAN2_NDAT2_ND45       (0x1U<<13)
#define FDCAN2_NDAT2_ND44       (0x1U<<12)
#define FDCAN2_NDAT2_ND43       (0x1U<<11)
#define FDCAN2_NDAT2_ND42       (0x1U<<10)
#define FDCAN2_NDAT2_ND41       (0x1U<<9)
#define FDCAN2_NDAT2_ND40       (0x1U<<8)
#define FDCAN2_NDAT2_ND39       (0x1U<<7)
#define FDCAN2_NDAT2_ND38       (0x1U<<6)
#define FDCAN2_NDAT2_ND37       (0x1U<<5)
#define FDCAN2_NDAT2_ND36       (0x1U<<4)
#define FDCAN2_NDAT2_ND35       (0x1U<<3)
#define FDCAN2_NDAT2_ND34       (0x1U<<2)
#define FDCAN2_NDAT2_ND33       (0x1U<<1)
#define FDCAN2_NDAT2_ND32       (0x1U<<0)

// RXF0C Configuration

#define FDCAN2_RXF0C_F0WM       (0xFFU<<24)
#define FDCAN2_RXF0C_F0WM_0     (0x1U<<24)
#define FDCAN2_RXF0C_F0S        (0xFFU<<16)
#define FDCAN2_RXF0C_F0S_0      (0x1U<<16)
#define FDCAN2_RXF0C_F0SA       (0x3FFFU<<2)
#define FDCAN2_RXF0C_F0SA_0     (0x1U<<2)

// RXF0S Configuration

#define FDCAN2_RXF0S_RF0L       (0x1U<<25)
#define FDCAN2_RXF0S_F0F        (0x1U<<24)
#define FDCAN2_RXF0S_F0P        (0x3FU<<16)
#define FDCAN2_RXF0S_F0P_0      (0x1U<<16)
#define FDCAN2_RXF0S_F0G        (0x3FU<<8)
#define FDCAN2_RXF0S_F0G_0      (0x1U<<8)
#define FDCAN2_RXF0S_F0FL       (0x7FU<<0)
#define FDCAN2_RXF0S_F0FL_0     (0x1U<<0)

// RXF0A Configuration

#define FDCAN2_RXF0A_FA01       (0x3FU<<0)
#define FDCAN2_RXF0A_FA01_0     (0x1U<<0)

// RXBC Configuration

#define FDCAN2_RXBC_RBSA        (0x3FFFU<<2)
#define FDCAN2_RXBC_RBSA_0      (0x1U<<2)

// RXF1C Configuration

#define FDCAN2_RXF1C_F1WM       (0x7FU<<24)
#define FDCAN2_RXF1C_F1WM_0     (0x1U<<24)
#define FDCAN2_RXF1C_F1S        (0x7FU<<16)
#define FDCAN2_RXF1C_F1S_0      (0x1U<<16)
#define FDCAN2_RXF1C_F1SA       (0x3FFFU<<2)
#define FDCAN2_RXF1C_F1SA_0     (0x1U<<2)

// RXF1S Configuration

#define FDCAN2_RXF1S_DMS        (0x3U<<30)
#define FDCAN2_RXF1S_DMS_0      (0x1U<<30)
#define FDCAN2_RXF1S_RF1L       (0x1U<<25)
#define FDCAN2_RXF1S_F1F        (0x1U<<24)
#define FDCAN2_RXF1S_F1PI       (0x7FU<<16)
#define FDCAN2_RXF1S_F1PI_0     (0x1U<<16)
#define FDCAN2_RXF1S_F1GI       (0x7FU<<8)
#define FDCAN2_RXF1S_F1GI_0     (0x1U<<8)
#define FDCAN2_RXF1S_F1FL       (0x7FU<<0)
#define FDCAN2_RXF1S_F1FL_0     (0x1U<<0)

// RXF1A Configuration

#define FDCAN2_RXF1A_F1AI       (0x3FU<<0)
#define FDCAN2_RXF1A_F1AI_0     (0x1U<<0)

// RXESC Configuration

#define FDCAN2_RXESC_RBDS       (0x7U<<8)
#define FDCAN2_RXESC_RBDS_0     (0x1U<<8)
#define FDCAN2_RXESC_F1DS       (0x7U<<4)
#define FDCAN2_RXESC_F1DS_0     (0x1U<<4)
#define FDCAN2_RXESC_F0DS       (0x7U<<0)
#define FDCAN2_RXESC_F0DS_0     (0x1U<<0)

// TXBC Configuration

#define FDCAN2_TXBC_TFQM        (0x1U<<30)
#define FDCAN2_TXBC_TFQS        (0x3FU<<24)
#define FDCAN2_TXBC_TFQS_0      (0x1U<<24)
#define FDCAN2_TXBC_NDTB        (0x3FU<<16)
#define FDCAN2_TXBC_NDTB_0      (0x1U<<16)
#define FDCAN2_TXBC_TBSA        (0x3FFFU<<2)
#define FDCAN2_TXBC_TBSA_0      (0x1U<<2)

// TXFQS Configuration

#define FDCAN2_TXFQS_TFQF       (0x1U<<21)
#define FDCAN2_TXFQS_TFQPI      (0x1FU<<16)
#define FDCAN2_TXFQS_TFQPI_0    (0x1U<<16)
#define FDCAN2_TXFQS_TFGI       (0x1FU<<8)
#define FDCAN2_TXFQS_TFGI_0     (0x1U<<8)
#define FDCAN2_TXFQS_TFFL       (0x3FU<<0)
#define FDCAN2_TXFQS_TFFL_0     (0x1U<<0)

// TXESC Configuration

#define FDCAN2_TXESC_TBDS       (0x7U<<0)
#define FDCAN2_TXESC_TBDS_0     (0x1U<<0)

// TXBRP Configuration

#define FDCAN2_TXBRP_TRP        (0xFFFFFFFFU<<0)
#define FDCAN2_TXBRP_TRP_0      (0x1U<<0)

// TXBAR Configuration

